[{"id": 1, "date": "2025-10-28", "title": "Research Update from the MCM Team (October 2025)", "category": "Research Update", "summary": "As we continue to explore top-scoring genes associated with the development of cancer through the Mapping Cancer Markers (MCM) project, we are excited to share a new research update! This article features NELL2 (Neural EGF-Like-Like protein 2), a gene that plays multiple roles in neural development ...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=827"}, {"id": 2, "date": "2025-08-29", "title": "IMMINENT DOWNTIME: Full Migration of WCG to Nibi cloud as Graham cloud is decomissioned August 31st, 2025", "category": "System", "summary": "We expect between 3:00-5:00 p.m. on August 31st, 2025 that all WCG endpoints will be down as we switch over to Nibi cloud. In preparation, we will systematically shut down prod leading up to cutover. Projects: Mapping Cancer Markers, Africa Rainfall Project, Mapping Arthritis Markers", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=826"}, {"id": 3, "date": "2025-07-14", "title": "Research Update from the MCM Team (July 2025)", "category": "Research Update", "summary": "As reported in our previous research updates, we are investigating the top-scoring genes with associations to various cancers as part of the Mapping Cancer Markers (MCM) project. This article focuses on Ecdysoneless Cell Cycle Regulator (ECD), a gene that is involved in regulating growth and repair....", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=825"}, {"id": 4, "date": "2025-05-21", "title": "Research Update from the MCM Team (May 2025)", "category": "Research Update", "summary": "Drawing upon our previous research updates, we are investigating the top-scoring genes with associations to various cancers as part of the Mapping Cancer Markers (MCM) project. This research update focuses on PDE8B (Phosphodiesterase 8B), a gene that is involved in hormone synthesis and has altered ...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=823"}, {"id": 5, "date": "2025-03-18", "title": "Research Update from the MCM Team (March 2025)", "category": "Research Update", "summary": "As part of our ongoing research updates, we continue to explore the top-scoring genes linked to lung cancer identified by the Mapping Cancer Markers (MCM) project. Following our previous focus on GCM1, this update examines DYNLT1 (Dynein Light Chain Tctex-Type 1), a gene with pivotal roles in intrac...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=822"}, {"id": 6, "date": "2025-01-21", "title": "Research Update from the MCM Team (January 2025)", "category": "Research Update", "summary": "We continue to investigate molecular signatures linked to lung cancer, with a current focus on GCM1, a transcription factor involved in placental development and potentially significant in lung cancer biology. The GCM1 gene encodes a protein with a gcm-motif, playing a central role in DNA-binding an...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=819"}, {"id": 7, "date": "2024-07-10", "title": "Research Update from the MCM team (July 2024)", "category": "Research Update", "summary": "We continue to characterise lung cancer biomarkers identified in the MCM1 project. This update focuses on ASTN2, a protein involved in neuronal migration. It is expressed across several tissue types, and has been implicated in various cancers. - Chiari malformation type I: A malformation in which pa...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=813"}, {"id": 8, "date": "2024-05-13", "title": "Research update from the MCM team (May 2024)", "category": "News", "summary": "We continue to characterise lung cancer biomarkers identified in the MCM1 project. This update focuses on KLF5, a well-studied gene that has been implicated in several cancer types. KLF5 is a transcription factor, which is expressed across numerous organs and tissues. - Transcription factor: A prote...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=812"}, {"id": 9, "date": "2024-03-14", "title": "Research update from the MCM team (March 2024)", "category": "News", "summary": "We continue to characterise lung cancer biomarkers identified in the MCM1 project. This update focuses on HSD17B11, a gene associated with lung cancer survival. HSD17B11 is a protein coding gene, relatively ubiquitously expressed across organs and tissues. It is a short-chain alcohol dehydrogenase t...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=809"}, {"id": 10, "date": "2024-02-16", "title": "Research Update from the MCM Team (February 2024)", "category": "Research Update", "summary": "We continue our work on characterising lung cancer biomarkers identified in the MCM1 project. This update focuses on a transcriptional corepressor TLE3. - Transcription factor: A protein that binds to DNA to control the rate at which DNA is transcribed to messenger RNA. - Trancriptional corepressor: ...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=807"}, {"id": 11, "date": "2024-01-16", "title": "Research update from the MCM team (January 2024)", "category": "News", "summary": "We continue our work on characterizing lung cancer biomarkers identified in the MCM1 project. This update focuses on PCSK5, a gene associated with lung cancer survival and which shows differential expression across various cancer types. - Proprotein: An inactive protein that can be modified to becom...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=805"}, {"id": 12, "date": "2023-11-27", "title": "Research update from the MCM team (November 2023)", "category": "News", "summary": "We continue our work on characterizing lung cancer biomarkers identified in the MCM1 project. This update focuses on IL13RA1, a gene associated with lung cancer survival and differentially expressed across multiple cancer types compared to normal tissues. Recognizing patterns in cancer patients can ...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=804"}, {"id": 13, "date": "2023-09-22", "title": "Research update from the MCM team (September 2023)", "category": "News", "summary": "The MCM team’s analysis has shown that ovarian cancer results were dishomogeneous. We will begin running additional ovarian work units starting September 25th. The Mapping Cancer Marker project aims to identify biomarkers associated with various cancers. By analyzing millions of data points from pat...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=802"}, {"id": 14, "date": "2023-09-15", "title": "MCM team update: ADH6", "category": "News", "summary": "We continue our work on characterizing lung cancer biomarkers identified in the MCM1 project. This update focuses on ADH6, a gene associated with smoking status and lung cancer prognosis. Recognizing patterns in cancer patients can have many benefits, such as making it possible to detect signs of ca...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=800"}, {"id": 15, "date": "2023-07-12", "title": "MCM team has been researching GSDMB", "category": "News", "summary": "We continue our work on characterizing lung cancer biomarkers identified in the MCM1 project. This update focuses on GSDMB, a gene associated with lung cancer survival and differentially expressed across multiple cancer types compared to normal tissues. Recognizing patterns in cancer patients can ha...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=797"}, {"id": 16, "date": "2023-04-28", "title": "Research update from the MCM team (April 2023)", "category": "News", "summary": "The MCM team’s research into lung cancer biomarkers has identified 26 genes that are present with top scores across all the signature sizes considered. This update focuses on a potential biomarker gene called FARP1, which is linked to lung cancer metastasis. The Mapping Cancer Markers project aims t...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=794"}, {"id": 17, "date": "2023-03-20", "title": "Research update from the MCM team (March 2023)", "category": "News", "summary": "The MCM team’s research into lung cancer biomarkers has identified 26 genes that are present with top scores across all the signature sizes considered. This update focuses on VAMP1, a gene linked to patient survival and differentially expressed in normal lung compared to lung cancer. The Mapping Can...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=782"}, {"id": 18, "date": "2022-04-01", "title": "Mapping Cancer Markers Q&A", "category": "News", "summary": "Mapping cancer markers researchers answer questions asked on the forum You asked: \"Are there any plans to optimize this project for a particular operating system Linux/Windows/ Mac OS/Android ? I think the GPU option was answered a while back as being non-applicable.\" and \"Are ther...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=767"}, {"id": 19, "date": "2021-11-16", "title": "Volunteers tested 15 trillion signatures for Mapping Cancer Markers project", "category": "News", "summary": "In this update, coinciding with the 17th anniversary of WCG, the research team summarizes the contribution of all volunteers to each type of tumor and signature size that Mapping Cancer Markers has studied so far. Mapping Cancer Markers (MCM) aims to identify the markers (sometimes referred to as si...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=747"}, {"id": 20, "date": "2021-09-09", "title": "September Update: Mapping Cancer Markers", "category": "News", "summary": "Thanks to additional support from volunteers, the project has seen a significant increase in work units processed over the summer. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=731"}, {"id": 21, "date": "2021-08-18", "title": "August Update: Mapping Cancer Markers", "category": "News", "summary": "World Community Grid is processing work for this project more quickly, thanks to increased volunteer support. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of healthy and cancerou...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=724"}, {"id": 22, "date": "2021-07-27", "title": "July Update: Mapping Cancer Markers", "category": "News", "summary": "Looking for a project to support? Mapping Cancer Markers has a large amount of work to be done to help fight a devastating collection of diseases. Members of the Jurisica Lab, the researchers behind Mapping Cancer Markers Mapping Cancer Markers aims to identify the markers associated with various ty...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=721"}, {"id": 23, "date": "2021-06-22", "title": "June Update: Mapping Cancer Markers", "category": "News", "summary": "Looking for an additional project to support? Please add Mapping Cancer Markers to your list. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of healthy and cancerous patient tissue...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=712"}, {"id": 24, "date": "2021-05-21", "title": "May Update: Mapping Cancer Markers", "category": "News", "summary": "The researchers have done further validation on their lung cancer marker data. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of healthy and cancerous patient tissue samples. These...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=704"}, {"id": 25, "date": "2021-04-20", "title": "April Update: Mapping Cancer Markers", "category": "News", "summary": "The researchers continue to work on a paper about lung cancer markers. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of healthy and cancerous patient tissue samples. These include...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=698"}, {"id": 26, "date": "2021-03-16", "title": "March Update: Mapping Cancer Markers", "category": "News", "summary": "The researchers continue to process work on World Community Grid while working on a paper about lung cancer markers. The illustration above (from a past project update) depicts proteins grouped by similar interactions and similar biological functions.  The highly interconnected human protein-protein...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=689"}, {"id": 27, "date": "2021-02-16", "title": "January/February Update: Mapping Cancer Markers", "category": "News", "summary": "Work continues on a paper about lung cancer markers. Members of the Jurisica Lab, the researchers behind Mapping Cancer Markers Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of he...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=683"}, {"id": 28, "date": "2020-12-29", "title": "December Update: Mapping Cancer Markers", "category": "News", "summary": "The researchers and World Community Grid's tech team continue to work together on developing new sarcoma work units. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of healthy and c...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=678"}, {"id": 29, "date": "2020-12-03", "title": "Upcoming code changes will help improve Mapping Cancer Markers", "category": "News", "summary": "In this update, the Mapping Cancer Markers research team explains how a relatively small code change could have a big impact on the project’s ability to analyze markers for various types of sarcoma. Mapping Cancer Markers aims to identify the markers (sometimes referred to as signatures) associated ...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=669"}, {"id": 30, "date": "2020-11-24", "title": "November Update: Mapping Cancer Markers", "category": "News", "summary": "The researchers are finishing a paper about their lung cancer findings, and continuing work on new work units for sarcoma. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of healthy...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=668"}, {"id": 31, "date": "2020-10-27", "title": "October Update: Mapping Cancer Markers", "category": "News", "summary": "We completed a successful beta test for new sarcoma work units in October. Mapping Cancer Markers aims to identify the markers associated with various types of cancer. The project is analyzing millions of data points collected from thousands of healthy and cancerous patient tissue samples. These inc...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=659"}, {"id": 32, "date": "2020-09-29", "title": "A young man’s passion for cancer informatics lives on", "category": "News", "summary": "Ian Lawson Van Toch, an intern at the Jurisica Lab, tragically passed away in 2007 during his first year of graduate school. His memory is honored by Ian’s Fund, which helps young scientists launch their careers in cancer informatics. As an undergraduate studying biomedical computing at Queen&amp;rsquo;...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=651"}, {"id": 33, "date": "2020-09-22", "title": "September Update: Mapping Cancer Markers", "category": "News", "summary": "Mapping Cancer Markers currently has a healthy backlog of work for volunteers, with more expected to come. The illustration above (from a past project update) depicts proteins grouped by similar interactions and similar biological functions. The highly interconnected human protein-protein interactio...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=649"}, {"id": 34, "date": "2020-08-21", "title": "August Update: Mapping Cancer Markers", "category": "News", "summary": "The Mapping Cancer Markers researchers continue to analyze lung cancer marker data while working with the World Community Grid tech team on new sarcoma work units. Members of the Jurisica Lab, the researchers behind Mapping Cancer Markers Mapping Cancer Markers aims to identify the markers associate...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=638"}, {"id": 35, "date": "2020-07-27", "title": "Behind the Scenes with World Community Grid&#39;s Active Projects", "category": "News", "summary": "Interested in learning more about our monthly calls with the researchers for each active World Community Grid project? You can get updates on our website, in our forum, and via email. Projects: FightAIDS@Home, Mapping Cancer Markers, Help Stop TB, Smash Childhood Cancer, Microbiome Imm...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=632"}, {"id": 36, "date": "2020-06-17", "title": "This is how a global community unites to find cancer biomarkers.", "category": "News", "summary": "Sawyer created a World Community Grid team to help accelerate research after his father was diagnosed with brain cancer. In the process, he found a global community of volunteers who are helping scientists at Krembil Research Institute find cancer biomarkers, which could lead to better diagnosis and...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=628"}, {"id": 37, "date": "2020-01-31", "title": "Mapping Cancer Markers Researchers Analyzing Lung Cancer Data", "category": "News", "summary": "The Mapping Cancer Markers team discusses the past (lung cancer), present (ovarian cancer), and future (sarcoma) of the project in this comprehensive update. The Mapping Cancer Markers (MCM) project was designed to identify the markers associated with various types of cancer, and by refining the pro...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=617"}, {"id": 38, "date": "2019-08-15", "title": "Stockholm Science &amp; Innovation School Competition Donates 25 Years of Computing Time to Cancer and Microbiome Research", "category": "News", "summary": "A high school in Sweden chose to support Mapping Cancer Markers and the Microbiome Immunity Project during a one-month competition between five World Community Grid teams. Here’s what they learned during the process. Projects: Mapping Cancer Markers, Microbiome Immunity Project Five te...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=601"}, {"id": 39, "date": "2018-08-08", "title": "Sarcoma Dataset Coming Soon to Mapping Cancer Markers Project", "category": "News", "summary": "In this comprehensive update, the Mapping Cancer Markers team explains how they are determining which genes and gene signatures carry the greatest promise for lung cancer diagnosis. They also introduce the next type of cancer--sarcoma--to be added soon to the project. Author: Dr. Igor Jurisica, Krem...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=571"}, {"id": 40, "date": "2017-11-30", "title": "New Facility and Expanded Plans for the Mapping Cancer Markers Research Team", "category": "News", "summary": "The Mapping Cancer Markers researchers recently moved to a new institute, but continues analyzing results, planning for expanded research, and creating new work units throughout the transition. Learn about their plans in this article. Author: Dr. Igor Jurisica, Krembil Research Institute, University...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=545"}, {"id": 41, "date": "2017-04-06", "title": "Mapping Cancer Markers Team Analyzes Lung Cancer Data", "category": "News", "summary": "In this project update, the Mapping Cancer Markers team describes how they are analyzing 45 million of the most promising lung cancer data results, and how they have begun to disseminate their early findings. The Mapping Cancer Markers (MCM) project continues to process work units for the Ovarian Ca...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=520"}, {"id": 42, "date": "2016-10-17", "title": "Mapping Cancer Markers Begins Analyzing Lung and Ovarian Cancer Data", "category": "News", "summary": "The Mapping Cancer Markers researchers are analyzing the results of the lung cancer research tasks run on World Community Grid, as well as the first sets of ovarian cancer data. This update gives a detailed look at the tools and processes they are using for this analysis, plus a list of their recent...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=504"}, {"id": 43, "date": "2016-04-21", "title": "Mapping Cancer Markers Now Examining Ovarian Cancer", "category": "News", "summary": "The Mapping Cancer Markers project now includes markers for the most common form of ovarian cancer, with a goal to understand the how this disease progresses from early-stage to late-stage.", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=477"}, {"id": 44, "date": "2015-12-15", "title": "Working to detect lung and ovarian cancers before they start", "category": "News", "summary": "Recent stages of the Mapping Cancer Markers (MCM) project have illuminated the protein-protein interactions and biological pathways involved in lung cancer, and have also suggested surprising results about its biomarkers. Once this current stage is complete, MCM will transition to analyzing ovarian ...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=457"}, {"id": 45, "date": "2015-08-19", "title": "One step closer to identifying lung cancer biomarkers", "category": "News", "summary": "Although work continues, enough data has already been processed to let the Mapping Cancer Markers team begin identifying high-scoring signatures and associating them with particular lung cancer biomarkers. The ultimate goal is to find signatures that distinguish many types of cancer, giving physicia...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=443"}, {"id": 46, "date": "2015-02-12", "title": "Using one cancer to help defeat many: Mapping Cancer Markers makes progress", "category": "News", "summary": "Results from the first stage of the Mapping Cancer Markers project are helping the researchers identify the markers for lung cancer, as well as improve their research methodology as they move on to analyze other cancers.", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=419"}, {"id": 47, "date": "2014-10-27", "title": "Early-stage results from the Mapping Cancer Markers team", "category": "News", "summary": "Thanks to your help, the Mapping Cancer Markers team is nearly finished with benchmarking their first set of genetic markers. In this update, the team presents an in-depth review of what they've accomplished thus far, and what significance this early work will have for cancer research at their lab a...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=389"}, {"id": 48, "date": "2014-10-02", "title": "Project roadmap and first phase results from the Mapping Cancer Markers team", "category": "News", "summary": "The lead researcher for Mapping Cancer Markers presents a roadmap for the project to analyze signatures for 4 types of cancer: lung, ovarian, prostate and sarcoma; an update on his team’s progress thus far, and an invitation to join the research team in an August cancer fundraiser.", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=369"}, {"id": 49, "date": "2014-04-08", "title": "Addressing issues with volunteers sending results", "category": "News", "summary": "Volunteers may have recently experienced issues sending us their results. We have taken several measures to address this.", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=351"}, {"id": 50, "date": "2014-03-13", "title": "Mapping Cancer Markers research application update", "category": "News", "summary": "New release of the Mapping Cancer Markers research application to address a recent checkpointing issue.", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=345"}, {"id": 51, "date": "2013-11-25", "title": "Mapping Cancer Markers project launch", "category": "Milestone", "summary": "A new World Community Grid project will help identify characteristic chemical \"markers\" for different types of cancer, thus leading to better detection, more personalized treatments and faster future research. Join Mapping Cancer Markers to help researchers find the chemical signatures of several de...", "link": "https://www.worldcommunitygrid.org/about_us/article.s?articleId=331"}]